ErpTest/src/InformationRegisters/ПорядокОтраженияТМЦВЭксплуатации/ПорядокОтраженияТМЦВЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПорядокОтраженияТМЦВЭксплуатации</name>
  <resources>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗабалансовогоУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияЭксплуатации</name>
    <type>
      <types>CatalogRef.КатегорииЭксплуатации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/ОтражениеДокументовВРеглУчете/ОтражениеДокументовВРеглУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтражениеДокументовВРеглУчете</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОтраженияДокументовВРеглУчете</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ИдентификаторСтатуса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОтражения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/СчетаРеглУчетаТребующиеНастройки/СчетаРеглУчетаТребующиеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СчетаРеглУчетаТребующиеНастройки</name>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>CatalogRef.КатегорииЭксплуатации</types>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
      <types>CatalogRef.ГруппыФинансовогоУчетаВнеоборотныхАктивов</types>
      <types>CatalogRef.ГруппыФинансовогоУчетаРасчетов</types>
      <types>CatalogRef.ГруппыФинансовогоУчетаНоменклатуры</types>
      <types>CatalogRef.Кассы</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
      <types>CatalogRef.ВидыПодарочныхСертификатов</types>
      <types>CatalogRef.Резервы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоУчета</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСчета</name>
    <type>
      <types>EnumRef.ВидыСчетовРеглУчета</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/Enums/ТипыОперацийВводаОстатков/ТипыОперацийВводаОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОперацийВводаОстатков</name>
  <enumValues>
    <name>ОстаткиВАвтономныхКассахККМКОформлениюОтчетовОРозничныхПродажах</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиВАвтономныхКассахККМПоРозничнойВыручке</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиВКассах</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиЗадолженностиКлиентов</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиЗадолженностиПередПоставщиками</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиЗадолженностиПодотчетников</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиНаБанковскихСчетах</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПоАвансамКлиентов</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПоАвансамПоставщикам</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиРасчетовМеждуОрганизациямиПоАвансам</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиРасчетовМеждуОрганизациямиПоРеализациям</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиСобственныхТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиТоваровПереданныхНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиТоваровПолученныхНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ПерерасходыПодотчетныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредстваКПоступлениюОтЭквайера</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиВозвратнойТарыПереданнойКлиентам</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиВозвратнойТарыПринятойОтПоставщиков</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаИспользованиеАдресногоХраненияОстатков</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаИспользованиеСкладскихПомещений</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПрочихАктивовПассивов</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныеСертификаты</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиОС</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиНМА</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПоДоговорамКредитовИДепозитов</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиТМЦВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиМатериаловПереданныхПереработчикам</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиМатериаловПереданныхВПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПрочихРасходов</name>
  </enumValues>
  <enumValues>
    <name>ФинансовыйРезультатЗаПрошлыеПериоды</name>
  </enumValues>
  <enumValues>
    <name>ОптовыеПродажиЗаПрошлыеПериоды</name>
  </enumValues>
  <enumValues>
    <name>РозничныеПродажиЗаПрошлыеПериоды</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиАрендованныхОС</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПредметовЛизингаНаБалансе</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПредметовЛизингаЗаБалансом</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиВзаиморасчетовПоДоговорамЛизинга</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПереданныхВАрендуОС</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПереданныхВАрендуПредметовЛизингаНаБалансе</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиНДСПоПриобретеннымЦенностям</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПрочихРасходовУСН</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиРасходовУСНПоМатериалам</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиРасходовУСНПоТоварам</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Enums/СтатусыОтраженияДокументовВРеглУчете/СтатусыОтраженияДокументовВРеглУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОтраженияДокументовВРеглУчете</name>
  <enumValues>
    <name>КОтражениюВРеглУчете</name>
  </enumValues>
  <enumValues>
    <name>ОтраженоВРеглУчете</name>
  </enumValues>
  <enumValues>
    <name>НеУказаныСчетаУчета</name>
  </enumValues>
  <enumValues>
    <name>ОтраженоВУчетеВручную</name>
  </enumValues>
  <enumValues>
    <name>КОтражениюВУчетеВручную</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Enums/ВидыСчетовРеглУчета/ВидыСчетовРеглУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСчетовРеглУчета</name>
  <enumValues>
    <name>АвансыВыданные</name>
  </enumValues>
  <enumValues>
    <name>АвансыПолученные</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтПродаж</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтПродажКомиссионера</name>
  </enumValues>
  <enumValues>
    <name>Доходы</name>
  </enumValues>
  <enumValues>
    <name>НаСкладе</name>
  </enumValues>
  <enumValues>
    <name>НДСпоПриобретеннымЦенностям</name>
  </enumValues>
  <enumValues>
    <name>НДСПриДоходах</name>
  </enumValues>
  <enumValues>
    <name>НДСПриЗакупке</name>
  </enumValues>
  <enumValues>
    <name>НДСПриОтгрузкеБезПереходаПраваСобственности</name>
  </enumValues>
  <enumValues>
    <name>НДСПриПродаже</name>
  </enumValues>
  <enumValues>
    <name>НДСПриПродажеКомиссионера</name>
  </enumValues>
  <enumValues>
    <name>РеализацияБезПереходаПраваСобственности</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеОперации</name>
  </enumValues>
  <enumValues>
    <name>Расходы</name>
  </enumValues>
  <enumValues>
    <name>РасходыМЦ</name>
  </enumValues>
  <enumValues>
    <name>УдалитьРасчетыПоВознаграждению</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоПодарочнымСертификатам</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоПретензиям</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКлиентами</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКлиентамиТара</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСПоставщиками</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСПоставщикамиТара</name>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродаж</name>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродажКомиссионера</name>
  </enumValues>
  <enumValues>
    <name>ТМЦВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ТМЦВЭксплуатацииЗаБалансом</name>
  </enumValues>
  <enumValues>
    <name>СписаниеРасходовОСНО</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеАктивыПассивы</name>
  </enumValues>
  <enumValues>
    <name>СписаниеРасходовЕНВД</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредства</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияВНА</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияВНА_ЦФ</name>
  </enumValues>
  <enumValues>
    <name>ВыбытиеВНА</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьВНА</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьВНА_ЦФ</name>
  </enumValues>
  <enumValues>
    <name>РезервДоОценкиВНА</name>
  </enumValues>
  <enumValues>
    <name>ЗабалансовыйУчетВНА</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКредиторамиОсновнойДолг</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКредиторамиКомиссия</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКредиторамиПроценты</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСДебиторамиОсновнойДолг</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСДебиторамиКомиссия</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСДебиторамиПроценты</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтПродажЕНВД</name>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродажЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВПереработку</name>
  </enumValues>
  <enumValues>
    <name>ЗатратыНаПриобретениеТМЦ</name>
  </enumValues>
  <enumValues>
    <name>НеотфактурованныеПоставки</name>
  </enumValues>
  <enumValues>
    <name>Резервы</name>
  </enumValues>
  <enumValues>
    <name>ЛизинговыеУслуги</name>
  </enumValues>
  <enumValues>
    <name>ОбеспечительныйПлатежПоЛизингу</name>
  </enumValues>
  <enumValues>
    <name>ВыкупПредметаЛизинга</name>
  </enumValues>
  <enumValues>
    <name>АрендныеОбязательстваПоЛизингу</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Catalogs/КатегорииЭксплуатации/КатегорииЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииЭксплуатации</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИнвентарныйУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПогашенияСтоимостиБУ</name>
    <type>
      <types>EnumRef.СпособыПогашенияСтоимостиТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокЭксплуатации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемНаработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияНаработки</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗабалансовогоУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПогашенияСтоимостиНУ</name>
    <type>
      <types>EnumRef.СпособыПогашенияСтоимостиТМЦ</types>
    </type>
  </attributes>
</mdclass:Catalog>

ErpTest/src/InformationRegisters/ПорядокОтраженияТМЦВЭксплуатации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает результат выполнения анализатора отражения ТМЦ в эксплуатации с настроенными счетами.
//	
//	Параметры:
//		МассивОрганизаций - Массив - СправочникСсылка.Организации - отбор по организациям;
//		Период - СтандартныйПериод - период с датой начала и окончания анализа.
//	ВозвращаемоеЗначение:
//		РезультатЗапроса - список всех операций, удовлетворяющий входным параметрам с настроенными для них счетами.
//
Функция РезультатЗапросаПоНастройкамОтраженияВУчете(МассивОрганизаций, Период) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	ПараметрыАнализатора = Новый Структура("МассивОрганизаций, НачалоПериода, КонецПериода", МассивОрганизаций, Период.ДатаНачала, Период.ДатаОкончания);
	Запрос.МенеджерВременныхТаблиц = ВременнаяТаблицаДанныхПоСуществующимОперациям(ПараметрыАнализатора);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДвиженияТМЦ.Организация КАК Организация,
	|	ДвиженияТМЦ.КатегорияЭксплуатации КАК КатегорияЭксплуатации,
	|	ИСТИНА КАК ЕстьПередачи,
	|	
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(ПорядокОтражения.СчетУчета, &ПустойСчет) <> &ПустойСчет
	|			ТОГДА ПорядокОтражения.СчетУчета
	|		ИНАЧЕ КатегорииЭксплуатации.СчетУчета
	|	КОНЕЦ КАК СчетУчета,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(ПорядокОтражения.СчетУчета, &ПустойСчет) = &ПустойСчет
	|				И КатегорииЭксплуатации.СчетУчета <> &ПустойСчет
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СчетУчетаПоУмолчанию,
	|	
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(ПорядокОтражения.СчетЗабалансовогоУчета, &ПустойСчет) <> &ПустойСчет
	|			ТОГДА ПорядокОтражения.СчетЗабалансовогоУчета
	|		ИНАЧЕ КатегорииЭксплуатации.СчетЗабалансовогоУчета
	|	КОНЕЦ КАК СчетЗабалансовогоУчета,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(ПорядокОтражения.СчетЗабалансовогоУчета, &ПустойСчет) = &ПустойСчет
	|				И КатегорииЭксплуатации.СчетЗабалансовогоУчета <> &ПустойСчет
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СчетЗабалансовогоУчетаПоУмолчанию
	|	
	|ИЗ
	|	ТаблицаДвижений КАК ДвиженияТМЦ
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ПорядокОтраженияТМЦВЭксплуатации КАК ПорядокОтражения
	|	ПО 
	|		ДвиженияТМЦ.Организация = ПорядокОтражения.Организация
	|		И ДвиженияТМЦ.КатегорияЭксплуатации = ПорядокОтражения.КатегорияЭксплуатации
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		Справочник.КатегорииЭксплуатации КАК КатегорииЭксплуатации
	|	ПО
	|		ДвиженияТМЦ.КатегорияЭксплуатации = КатегорииЭксплуатации.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПорядокОтражения.Организация,
	|	ПорядокОтражения.КатегорияЭксплуатации,
	|	ЛОЖЬ,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(ПорядокОтражения.СчетУчета, &ПустойСчет) <> &ПустойСчет
	|			ТОГДА ПорядокОтражения.СчетУчета
	|		ИНАЧЕ КатегорииЭксплуатации.СчетУчета
	|	КОНЕЦ КАК СчетУчета,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(ПорядокОтражения.СчетУчета, &ПустойСчет) = &ПустойСчет
	|				И КатегорииЭксплуатации.СчетУчета <> &ПустойСчет
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СчетУчетаПоУмолчанию,
	|	
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(ПорядокОтражения.СчетЗабалансовогоУчета, &ПустойСчет) <> &ПустойСчет
	|			ТОГДА ПорядокОтражения.СчетЗабалансовогоУчета
	|		ИНАЧЕ КатегорииЭксплуатации.СчетЗабалансовогоУчета
	|	КОНЕЦ КАК СчетЗабалансовогоУчета,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(ПорядокОтражения.СчетЗабалансовогоУчета, &ПустойСчет) = &ПустойСчет
	|				И КатегорииЭксплуатации.СчетЗабалансовогоУчета <> &ПустойСчет
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СчетЗабалансовогоУчетаПоУмолчанию
	|	
	|ИЗ
	|	РегистрСведений.ПорядокОтраженияТМЦВЭксплуатации КАК ПорядокОтражения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		ДвиженияТМЦ КАК ДвиженияТМЦ
	|	ПО 
	|		ПорядокОтражения.Организация = ДвиженияТМЦ.Организация
	|		И ПорядокОтражения.КатегорияЭксплуатации = ДвиженияТМЦ.КатегорияЭксплуатации
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		Справочник.КатегорииЭксплуатации КАК КатегорииЭксплуатации
	|	ПО
	|		ПорядокОтражения.КатегорияЭксплуатации = КатегорииЭксплуатации.Ссылка
	|	
	|ГДЕ
	|	ПорядокОтражения.Организация В(&Организации)
	|	И ДвиженияТМЦ.Организация ЕСТЬ NULL 
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	КатегорияЭксплуатации";
	Запрос.УстановитьПараметр("ПустойСчет", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ВременнаяТаблицаДанныхПоСуществующимОперациям(ПараметрыАнализатора)
	
	РежимАнализа = Неопределено;
	ПараметрыАнализатора.Свойство("РежимАнализа", РежимАнализа);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Организация КАК Организация,
	|	ЕСТЬNULL(Таблица.КатегорияЭксплуатации, ЗНАЧЕНИЕ(Справочник.КатегорииЭксплуатации.ПустаяСсылка)) КАК КатегорияЭксплуатации
	|ПОМЕСТИТЬ ТаблицаДвижений
	|ИЗ
	|	Документ.ВнутреннееПотреблениеТоваров КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров.Товары КАК Таблица
	|			ПО ДанныеДокумента.Ссылка = Таблица.Ссылка
	|ГДЕ
	|	&УсловиеДляДокумента
	|	И ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВЭксплуатацию)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Организация,
	|	ЕСТЬNULL(Таблица.КатегорияЭксплуатации, ЗНАЧЕНИЕ(Справочник.КатегорииЭксплуатации.ПустаяСсылка))
	|ИЗ
	|	Документ.ВводОстатков КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВводОстатков.ТМЦВЭксплуатации КАК Таблица
	|		ПО ДанныеДокумента.Ссылка = Таблица.Ссылка
	|ГДЕ
	|	&УсловиеДляДокумента
	|	И ДанныеДокумента.ТипОперации В (ЗНАЧЕНИЕ(Перечисление.ТипыОперацийВводаОстатков.ОстаткиТМЦВЭксплуатации))";
	
	УсловиеВхожденияВДокумент = "ГДЕ" + Символы.ПС + Символы.Таб + "&УсловиеДляДокумента";
	ТекстСоединенияСТаблицейДокументов = "		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
	|		ПО ДанныеДокумента.Организация = ТаблицаДокументов.Организация
	|			И ДанныеДокумента.Ссылка = ТаблицаДокументов.Документ";
	ТекстУсловийПоОрганизацииИПериоду = "ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ДанныеДокумента.Организация В (&Организации)";
	
	Если РежимАнализа = "ПоНеотраженным" Тогда
		
		Статусы = Новый Массив;
		Статусы.Добавить(Перечисления.СтатусыОтраженияДокументовВРеглУчете.НеУказаныСчетаУчета);
		Статусы.Добавить(Перечисления.СтатусыОтраженияДокументовВРеглУчете.КОтражениюВРеглУчете);
		РегистрыСведений.ОтражениеДокументовВРеглУчете.ДобавитьВременнуюТаблицуДокументовСОтборомПоСтатусуОтражения(
			Запрос.МенеджерВременныхТаблиц,
			ПараметрыАнализатора.МассивОрганизаций,
			Статусы);
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, УсловиеВхожденияВДокумент, ТекстСоединенияСТаблицейДокументов);
	Иначе
		Запрос.УстановитьПараметр("Организации", ПараметрыАнализатора.МассивОрганизаций);
		Запрос.УстановитьПараметр("ДатаНачала", ПараметрыАнализатора.НачалоПериода);
		Запрос.УстановитьПараметр("ДатаОкончания", ПараметрыАнализатора.КонецПериода);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, УсловиеВхожденияВДокумент, ТекстУсловийПоОрганизацииИПериоду);
	КонецЕсли;
	
	Запрос.Выполнить();
	
	Возврат Запрос.МенеджерВременныхТаблиц;
	
КонецФункции

Функция ВременнаяТаблицаДвиженийСоСчетами(ВременнаяТаблицаДвижений)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ВременнаяТаблицаДвижений;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДвижений.Организация КАК Организация,
	|	ТаблицаДвижений.КатегорияЭксплуатации КАК АналитикаУчета,
	|	ИСТИНА КАК ЕстьПередачи,
	|
	|	ВЫБОР КОГДА ЕСТЬNULL(ПорядокОтражения.СчетУчета, &ПустойСчет) = &ПустойСчет
	|		ТОГДА ЕСТЬNULL(АналитикаУчета.СчетУчета, ЕСТЬNULL(ОбщаяНастройка.СчетУчета, &ПустойСчет))
	|		ИНАЧЕ ПорядокОтражения.СчетУчета КОНЕЦ КАК СчетУчета,
	|	ВЫБОР КОГДА ЕСТЬNULL(ПорядокОтражения.СчетЗабалансовогоУчета, &ПустойСчет) = &ПустойСчет
	|		ТОГДА ЕСТЬNULL(АналитикаУчета.СчетЗабалансовогоУчета, ЕСТЬNULL(ОбщаяНастройка.СчетУчета, &ПустойСчет))
	|		ИНАЧЕ ПорядокОтражения.СчетЗабалансовогоУчета КОНЕЦ КАК СчетЗабалансовогоУчета,
	|
	|	ЕСТЬNULL(АналитикаУчета.СчетУчета, ЕСТЬNULL(ОбщаяНастройка.СчетУчета, &ПустойСчет))
	|		= ЕСТЬNULL(ПорядокОтражения.СчетУчета, &ПустойСчет)
	|		ИЛИ ЕСТЬNULL(АналитикаУчета.СчетУчета, ЕСТЬNULL(ОбщаяНастройка.СчетУчета, &ПустойСчет)) <> &ПустойСчет
	|		И ЕСТЬNULL(ПорядокОтражения.СчетУчета, &ПустойСчет) = &ПустойСчет КАК СчетУчетаПоУмолчанию,
	|	ЕСТЬNULL(АналитикаУчета.СчетЗабалансовогоУчета, ЕСТЬNULL(ОбщаяНастройка.СчетЗабалансовогоУчета, &ПустойСчет))
	|		= ЕСТЬNULL(ПорядокОтражения.СчетЗабалансовогоУчета, &ПустойСчет)
	|		ИЛИ ЕСТЬNULL(АналитикаУчета.СчетЗабалансовогоУчета, ЕСТЬNULL(ОбщаяНастройка.СчетЗабалансовогоУчета, &ПустойСчет)) <> &ПустойСчет
	|		И ЕСТЬNULL(ПорядокОтражения.СчетЗабалансовогоУчета, &ПустойСчет) = &ПустойСчет КАК СчетЗабалансовогоУчетаПоУмолчанию
	|
	|ПОМЕСТИТЬ ТаблицаДвиженийСоСчетами
	|ИЗ
	|	ТаблицаДвижений КАК ТаблицаДвижений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияТМЦВЭксплуатации КАК ПорядокОтражения
	|		ПО ТаблицаДвижений.Организация = ПорядокОтражения.Организация
	|			И ТаблицаДвижений.КатегорияЭксплуатации = ПорядокОтражения.КатегорияЭксплуатации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КатегорииЭксплуатации КАК АналитикаУчета
	|		ПО ТаблицаДвижений.КатегорияЭксплуатации = АналитикаУчета.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияТМЦВЭксплуатации КАК ОбщаяНастройка
	|		ПО ОбщаяНастройка.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			И ОбщаяНастройка.КатегорияЭксплуатации = ЗНАЧЕНИЕ(Справочник.КатегорииЭксплуатации.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ПустойСчет", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	Запрос.Выполнить();
	
	Возврат Запрос.МенеджерВременныхТаблиц;
	
КонецФункции

// Выполняет анализ всех неотраженных операций отражения ТМЦ в эксплуатации,
//	ищет для них ненастроенные счета учета и заносит эти данные в регистр ненастроенных счетов учета.
//	
//	Параметры:
//		ПараметрыАнализатора - Структура, содержащая следующие значения:
//			* МассивОрганизаций - Массив - СправочникСсылка.Организации - отбор по организациям, операции которых будут анализироваться;
//			* РежимАнализа - Строка - строка вида "ПоНеотраженным" -
//					необходимо для того, чтобы анализатор работал только по документам, неотраженным в регл. учете.
//
Процедура ЗаполнитьРегистрТребующихНастройкиНаОснованииАнализаНеотраженныхОпераций(ПараметрыАнализатора) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВременнаяТаблицаДвижений = ВременнаяТаблицаДанныхПоСуществующимОперациям(ПараметрыАнализатора);
	ВременнаяТаблицаДвиженийСоСчетами = ВременнаяТаблицаДвиженийСоСчетами(ВременнаяТаблицаДвижений);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ВременнаяТаблицаДвиженийСоСчетами;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДвиженийСоСчетами.Организация,
	|	ТаблицаДвиженийСоСчетами.АналитикаУчета,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦВЭксплуатации) КАК ВидСчета
	|ИЗ
	|	ТаблицаДвиженийСоСчетами КАК ТаблицаДвиженийСоСчетами
	|ГДЕ
	|	ТаблицаДвиженийСоСчетами.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДвиженийСоСчетами.Организация,
	|	ТаблицаДвиженийСоСчетами.АналитикаУчета,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦВЭксплуатацииЗаБалансом) КАК ВидСчета
	|ИЗ
	|	ТаблицаДвиженийСоСчетами КАК ТаблицаДвиженийСоСчетами
	|ГДЕ
	|	ТаблицаДвиженийСоСчетами.СчетЗабалансовогоУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураВидовСчетовИРезультатаЗапроса = Новый Соответствие;
	СтруктураВидовСчетовИРезультатаЗапроса.Вставить(Перечисления.ВидыСчетовРеглУчета.ТМЦВЭксплуатации, МассивРезультатов.Получить(0));
	СтруктураВидовСчетовИРезультатаЗапроса.Вставить(Перечисления.ВидыСчетовРеглУчета.ТМЦВЭксплуатацииЗаБалансом, МассивРезультатов.Получить(1));
	
	ИмяСобытия = НСтр("ru = 'Анализ порядка отражения ТМЦ в эксплуатации, требующего настройки'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	РегистрыСведений.СчетаРеглУчетаТребующиеНастройки.ЗаполнитьЗаписиРегистраПоВидамСчетов(СтруктураВидовСчетовИРезультатаЗапроса, ИмяСобытия);
	
КонецПроцедуры

// Выполняет анализ операций отражения ТМЦ в эксплуатации, в зависимости от параметров и дополняет исходную таблицу
// операций новыми строками.
//	
//	Параметры:
//		ПараметрыАнализа - Структура - содержит настройки анализатора со следующими свойствами:
//			* РежимАнализа - Строка - принимает значения вида "ПоНеотраженным" и "ЗаПериод". Причем если не задана, значение по умолчанию "ЗаПериод".
//			* КонецПериода - Дата - по эту дату анализируются операции, причем если режим анализа "ПоНеотраженным" не актуальна;
//			* НачалоПериода - Дата - начиная с этой даты анализируются операции, причем если режим анализа "ПоНеотраженным" не актуальна;
//			* МассивОрганизаций - Массив - СправочникСсылка.Организации - отбор по организациям, операции которых будут анализироваться;
//		АдресХранилища - Строка - адрес сохранения результата работы метода (ТаблицаЗначений).
//
Процедура ДополнитьТаблицуНаОснованииАнализаОпераций(ПараметрыАнализа, АдресХранилища) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВременнаяТаблицаДвижений = ВременнаяТаблицаДанныхПоСуществующимОперациям(ПараметрыАнализа);
	 
	ВременнаяТаблицаДвиженийСоСчетами = ВременнаяТаблицаДвиженийСоСчетами(ВременнаяТаблицаДвижений);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Таблица", ПараметрыАнализа.ЗаполняемаяТаблица);
	Запрос.МенеджерВременныхТаблиц = ВременнаяТаблицаДвиженийСоСчетами;
	 
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТекущаяТаблицаСчетовУчета.Организация,
	|	ТекущаяТаблицаСчетовУчета.КатегорияЭксплуатации,
	|
	|	ТекущаяТаблицаСчетовУчета.СчетУчета,
	|	ТекущаяТаблицаСчетовУчета.СчетЗабалансовогоУчета,
	|	
	|	ТекущаяТаблицаСчетовУчета.СчетУчетаПоУмолчанию,
	|	ТекущаяТаблицаСчетовУчета.СчетЗабалансовогоУчетаПоУмолчанию,
	|
	|	ТекущаяТаблицаСчетовУчета.ТребуетсяНастройкаСчетУчета,
	|	ТекущаяТаблицаСчетовУчета.ТребуетсяНастройкаСчетЗабалансовогоУчета,
	|
	|	ТекущаяТаблицаСчетовУчета.ТребуетсяНастройка,
	|	ТекущаяТаблицаСчетовУчета.ИзмененныеДанные
	|
	|ПОМЕСТИТЬ ТекущаяТаблицаСчетовУчета
	|ИЗ
	|	&Таблица КАК ТекущаяТаблицаСчетовУчета;
	|
	|///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДвиженийСоСчетами.Организация,
	|	ТаблицаДвиженийСоСчетами.АналитикаУчета КАК КатегорияЭксплуатации,
	|
	|	ЕСТЬNULL(ТекущаяТаблицаСчетовУчета.СчетУчета, ТаблицаДвиженийСоСчетами.СчетУчета) КАК СчетУчета,
	|	ЕСТЬNULL(ТекущаяТаблицаСчетовУчета.СчетЗабалансовогоУчета, ТаблицаДвиженийСоСчетами.СчетЗабалансовогоУчета) КАК СчетЗабалансовогоУчета,
	|	
	|	ЕСТЬNULL(ТекущаяТаблицаСчетовУчета.СчетУчетаПоУмолчанию, ТаблицаДвиженийСоСчетами.СчетУчетаПоУмолчанию) КАК СчетУчетаПоУмолчанию,
	|	ЕСТЬNULL(ТекущаяТаблицаСчетовУчета.СчетЗабалансовогоУчетаПоУмолчанию, ТаблицаДвиженийСоСчетами.СчетЗабалансовогоУчетаПоУмолчанию) КАК СчетЗабалансовогоУчетаПоУмолчанию,
	|
	|	ЕСТЬNULL(ТекущаяТаблицаСчетовУчета.СчетУчета, ТаблицаДвиженийСоСчетами.СчетУчета)
	|		= ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК ТребуетсяНастройкаСчетУчета,
	|	ЕСТЬNULL(ТекущаяТаблицаСчетовУчета.СчетЗабалансовогоУчета, ТаблицаДвиженийСоСчетами.СчетЗабалансовогоУчета)
	|		= ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК ТребуетсяНастройкаСчетЗабалансовогоУчета,
	|
	|	ЕСТЬNULL(ТекущаяТаблицаСчетовУчета.СчетУчета, ТаблицаДвиженийСоСчетами.СчетУчета) = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|		ИЛИ ЕСТЬNULL(ТекущаяТаблицаСчетовУчета.СчетЗабалансовогоУчета, ТаблицаДвиженийСоСчетами.СчетЗабалансовогоУчета)
	|		= ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК ТребуетсяНастройка,
	|	ЕСТЬNULL(ТекущаяТаблицаСчетовУчета.ИзмененныеДанные, ""СчетУчета, СчетЗабалансовогоУчета"") КАК ИзмененныеДанные
	|
	|ИЗ
	|	ТаблицаДвиженийСоСчетами КАК ТаблицаДвиженийСоСчетами
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТекущаяТаблицаСчетовУчета КАК ТекущаяТаблицаСчетовУчета
	|	ПО
	|		ТаблицаДвиженийСоСчетами.Организация = ТекущаяТаблицаСчетовУчета.Организация
	|		И ТаблицаДвиженийСоСчетами.АналитикаУчета = ТекущаяТаблицаСчетовУчета.КатегорияЭксплуатации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТекущаяТаблицаСчетовУчета.Организация,
	|	ТекущаяТаблицаСчетовУчета.КатегорияЭксплуатации,
	|
	|	ТекущаяТаблицаСчетовУчета.СчетУчета,
	|	ТекущаяТаблицаСчетовУчета.СчетЗабалансовогоУчета,
	|
	|	ТекущаяТаблицаСчетовУчета.СчетУчетаПоУмолчанию,
	|	ТекущаяТаблицаСчетовУчета.СчетЗабалансовогоУчетаПоУмолчанию,
	|
	|	ТекущаяТаблицаСчетовУчета.ТребуетсяНастройкаСчетУчета,
	|	ТекущаяТаблицаСчетовУчета.ТребуетсяНастройкаСчетЗабалансовогоУчета,
	|
	|	ТекущаяТаблицаСчетовУчета.ТребуетсяНастройка,
	|	ТекущаяТаблицаСчетовУчета.ИзмененныеДанные
	|ИЗ
	|	ТекущаяТаблицаСчетовУчета КАК ТекущаяТаблицаСчетовУчета
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаДвиженийСоСчетами КАК ТаблицаДвиженийСоСчетами
	|	ПО
	|		ТекущаяТаблицаСчетовУчета.Организация = ТаблицаДвиженийСоСчетами.Организация
	|		И ТекущаяТаблицаСчетовУчета.КатегорияЭксплуатации = ТаблицаДвиженийСоСчетами.АналитикаУчета
	|ГДЕ
	|	ТаблицаДвиженийСоСчетами.Организация ЕСТЬ NULL";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	ПоместитьВоВременноеХранилище(Новый Структура("СчетаУчетаТМЦВЭксплуатации", Таблица), АдресХранилища);
	
КонецПроцедуры

Процедура НайтиДокументыСоответствующиеНастройкам(ТаблицаНастроек, Дата, ТаблицаДокументов) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ИсходнаяТаблица.Организация КАК Организация,
	|	ИсходнаяТаблица.КатегорияЭксплуатации КАК КатегорияЭксплуатации
	|	
	|ПОМЕСТИТЬ ТаблицаНастроек
	|ИЗ
	|	&ИсходнаяТаблица КАК ИсходнаяТаблица
	|ГДЕ
	|	ИсходнаяТаблица.ИзмененныеДанные <> """"
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор КАК Документ,
	|	ОтражениеДокументовВРеглУчете.ДатаОтражения КАК ДатаОтражения,
	|	ОтражениеДокументовВРеглУчете.Организация КАК Организация
	|ИЗ
	|	РегистрНакопления.ТМЦВЭксплуатации.Обороты(
	|		,
	|		&ДатаОкончания,
	|		Регистратор,
	|		Организация В (
	|			ВЫБРАТЬ
	|				ТаблицаНастроек.Организация
	|			ИЗ
	|				ТаблицаНастроек КАК ТаблицаНастроек
	|		)
	|	) КАК ДанныеРегистра
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ОтражениеДокументовВРеглУчете КАК ОтражениеДокументовВРеглУчете
	|	ПО
	|		ДанныеРегистра.Регистратор = ОтражениеДокументовВРеглУчете.Регистратор
	|		И ОтражениеДокументовВРеглУчете.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОтраженияДокументовВРеглУчете.ОтраженоВРеглУчете)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ
	|;");
	
	ИсходнаяТаблица = ТаблицаНастроек.Выгрузить(, "Организация, НазначениеИспользования, ИзмененныеДанные");
	Запрос.УстановитьПараметр("ИсходнаяТаблица", ИсходнаяТаблица);
	Запрос.УстановитьПараметр("ДатаОкончания", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
